import re


def clean_text(text):
    """
    Очищує текст повідомлення:
    - переводить до нижнього регістру;
    - видаляє посилання;
    - прибирає зайві символи;
    - нормалізує пробіли.
    """

    text = str(text).lower()

    # Видалення посилань
    text = re.sub(r"http\S+|www\S+", "", text)

    # Видалення зайвих символів, але збереження українських літер і цифр
    text = re.sub(r"[^a-zA-Zа-яА-ЯіїєґІЇЄҐ0-9\s]", " ", text)

    # Видалення зайвих пробілів
    text = re.sub(r"\s+", " ", text).strip()

    return text